/*************************************************************************
	> File Name: lg1028.c
	> Author: 
	> Mail: 
	> Created Time: 2019年04月07日 星期日 10时15分50秒
 ************************************************************************/

#include<stdio.h>

int main(){
    int n,i;
    int f[1001];
    f[0] = 1;
    scanf("%d", &n);
    for(i = 1;i <= n; i++){
        if(i%2 == 0){
            f[i]=f[i-1]+f[i/2];
        }else{
            f[i]=f[i-1];
        }
    }
    printf("%d\n",f[n]);
    return  0;
}
